benchmarks/risingBubble/N80/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=64;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topWall
    {
        type            patch;
        nFaces          80;
        startFace       25360;
    }
    bottomWall
    {
        type            patch;
        nFaces          80;
        startFace       25440;
    }
    leftWall
    {
        type            patch;
        nFaces          160;
        startFace       25520;
    }
    rightWall
    {
        type            patch;
        nFaces          160;
        startFace       25680;
    }
    backWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       25840;
    }
    frontWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       38640;
    }
)

// ************************************************************************* //
